MikroElektronika/core_packages/PIC/XC8/def/PIC18LF47J13/mcu.h
// Register: DSWAKEL
#define DSWAKEL DSWAKEL
extern volatile unsigned char           DSWAKEL             __at(0xF4A);
#ifndef _LIB_BUILD
asm("DSWAKEL equ 0F4Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DSPOR                  :1;
        unsigned                        :1;
        unsigned DSMCLR                 :1;
        unsigned DSRTC                  :1;
        unsigned DSWDT                  :1;
        unsigned DSULP                  :1;
        unsigned                        :1;
        unsigned DSFLT                  :1;
    };
} DSWAKELbits_t;
extern volatile DSWAKELbits_t DSWAKELbits __at(0xF4A);
// bitfield macros
#define _DSWAKEL_DSPOR_POSN                                 0x0
#define _DSWAKEL_DSPOR_POSITION                             0x0
#define _DSWAKEL_DSPOR_SIZE                                 0x1
#define _DSWAKEL_DSPOR_LENGTH                               0x1
#define _DSWAKEL_DSPOR_MASK                                 0x1
#define _DSWAKEL_DSMCLR_POSN                                0x2
#define _DSWAKEL_DSMCLR_POSITION                            0x2
#define _DSWAKEL_DSMCLR_SIZE                                0x1
#define _DSWAKEL_DSMCLR_LENGTH                              0x1
#define _DSWAKEL_DSMCLR_MASK                                0x4
#define _DSWAKEL_DSRTC_POSN                                 0x3
#define _DSWAKEL_DSRTC_POSITION                             0x3
#define _DSWAKEL_DSRTC_SIZE                                 0x1
#define _DSWAKEL_DSRTC_LENGTH                               0x1
#define _DSWAKEL_DSRTC_MASK                                 0x8
#define _DSWAKEL_DSWDT_POSN                                 0x4
#define _DSWAKEL_DSWDT_POSITION                             0x4
#define _DSWAKEL_DSWDT_SIZE                                 0x1
#define _DSWAKEL_DSWDT_LENGTH                               0x1
#define _DSWAKEL_DSWDT_MASK                                 0x10
#define _DSWAKEL_DSULP_POSN                                 0x5
#define _DSWAKEL_DSULP_POSITION                             0x5
#define _DSWAKEL_DSULP_SIZE                                 0x1
#define _DSWAKEL_DSULP_LENGTH                               0x1
#define _DSWAKEL_DSULP_MASK                                 0x20
#define _DSWAKEL_DSFLT_POSN                                 0x7
#define _DSWAKEL_DSFLT_POSITION                             0x7
#define _DSWAKEL_DSFLT_SIZE                                 0x1
#define _DSWAKEL_DSFLT_LENGTH                               0x1
#define _DSWAKEL_DSFLT_MASK                                 0x80

// Register: DSWAKEH
#define DSWAKEH DSWAKEH
extern volatile unsigned char           DSWAKEH             __at(0xF4B);
#ifndef _LIB_BUILD
asm("DSWAKEH equ 0F4Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DSINT0                 :1;
    };
} DSWAKEHbits_t;
extern volatile DSWAKEHbits_t DSWAKEHbits __at(0xF4B);
// bitfield macros
#define _DSWAKEH_DSINT0_POSN                                0x0
#define _DSWAKEH_DSINT0_POSITION                            0x0
#define _DSWAKEH_DSINT0_SIZE                                0x1
#define _DSWAKEH_DSINT0_LENGTH                              0x1
#define _DSWAKEH_DSINT0_MASK                                0x1

// Register: DSCONL
#define DSCONL DSCONL
extern volatile unsigned char           DSCONL              __at(0xF4C);
#ifndef _LIB_BUILD
asm("DSCONL equ 0F4Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RELEASE                :1;
        unsigned DSBOR                  :1;
        unsigned ULPWDIS                :1;
    };
} DSCONLbits_t;
extern volatile DSCONLbits_t DSCONLbits __at(0xF4C);
// bitfield macros
#define _DSCONL_RELEASE_POSN                                0x0
#define _DSCONL_RELEASE_POSITION                            0x0
#define _DSCONL_RELEASE_SIZE                                0x1
#define _DSCONL_RELEASE_LENGTH                              0x1
#define _DSCONL_RELEASE_MASK                                0x1
#define _DSCONL_DSBOR_POSN                                  0x1
#define _DSCONL_DSBOR_POSITION                              0x1
#define _DSCONL_DSBOR_SIZE                                  0x1
#define _DSCONL_DSBOR_LENGTH                                0x1
#define _DSCONL_DSBOR_MASK                                  0x2
#define _DSCONL_ULPWDIS_POSN                                0x2
#define _DSCONL_ULPWDIS_POSITION                            0x2
#define _DSCONL_ULPWDIS_SIZE                                0x1
#define _DSCONL_ULPWDIS_LENGTH                              0x1
#define _DSCONL_ULPWDIS_MASK                                0x4

// Register: DSCONH
#define DSCONH DSCONH
extern volatile unsigned char           DSCONH              __at(0xF4D);
#ifndef _LIB_BUILD
asm("DSCONH equ 0F4Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RTCWDIS                :1;
        unsigned DSULPEN                :1;
        unsigned                        :5;
        unsigned DSEN                   :1;
    };
} DSCONHbits_t;
extern volatile DSCONHbits_t DSCONHbits __at(0xF4D);
// bitfield macros
#define _DSCONH_RTCWDIS_POSN                                0x0
#define _DSCONH_RTCWDIS_POSITION                            0x0
#define _DSCONH_RTCWDIS_SIZE                                0x1
#define _DSCONH_RTCWDIS_LENGTH                              0x1
#define _DSCONH_RTCWDIS_MASK                                0x1
#define _DSCONH_DSULPEN_POSN                                0x1
#define _DSCONH_DSULPEN_POSITION                            0x1
#define _DSCONH_DSULPEN_SIZE                                0x1
#define _DSCONH_DSULPEN_LENGTH                              0x1
#define _DSCONH_DSULPEN_MASK                                0x2
#define _DSCONH_DSEN_POSN                                   0x7
#define _DSCONH_DSEN_POSITION                               0x7
#define _DSCONH_DSEN_SIZE                                   0x1
#define _DSCONH_DSEN_LENGTH                                 0x1
#define _DSCONH_DSEN_MASK                                   0x80

// Register: DSGPR0
#define DSGPR0 DSGPR0
extern volatile unsigned char           DSGPR0              __at(0xF4E);
#ifndef _LIB_BUILD
asm("DSGPR0 equ 0F4Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DSGPR0                 :8;
    };
} DSGPR0bits_t;
