MikroElektronika/core_packages/PIC/XC8/def/PIC18LF47J13/mcu.h
#define                                 NOT_T5DONE_bit      _BIT_ACCESS(T5GCON,3)
// T5CON<NOT_T5SYNC>
extern volatile __bit                   NOT_T5SYNC          __at(0x7912);	// @ (0xF22 * 8 + 2)
#define                                 NOT_T5SYNC_bit      _BIT_ACCESS(T5CON,2)
// RCON<NOT_TO>
extern volatile __bit                   NOT_TO              __at(0x7E83);	// @ (0xFD0 * 8 + 3)
#define                                 NOT_TO_bit          _BIT_ACCESS(RCON,3)
// TXSTA1<NOT_TX8>
extern volatile __bit                   NOT_TX8             __at(0x7D6E);	// @ (0xFAD * 8 + 6)
#define                                 NOT_TX8_bit         _BIT_ACCESS(TXSTA1,6)
// SSP1STAT<NOT_W>
extern volatile __bit                   NOT_W               __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 NOT_W_bit           _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<NOT_W2>
extern volatile __bit                   NOT_W2              __at(0x7B9A);	// @ (0xF73 * 8 + 2)
#define                                 NOT_W2_bit          _BIT_ACCESS(SSP2STAT,2)
// SSP1STAT<NOT_WRITE>
extern volatile __bit                   NOT_WRITE           __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 NOT_WRITE_bit       _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<NOT_WRITE2>
extern volatile __bit                   NOT_WRITE2          __at(0x7B9A);	// @ (0xF73 * 8 + 2)
#define                                 NOT_WRITE2_bit      _BIT_ACCESS(SSP2STAT,2)
// PMSTATL<OB0E>
extern volatile __bit                   OB0E                __at(0x7AA0);	// @ (0xF54 * 8 + 0)
#define                                 OB0E_bit            _BIT_ACCESS(PMSTATL,0)
// PMSTATL<OB1E>
extern volatile __bit                   OB1E                __at(0x7AA1);	// @ (0xF54 * 8 + 1)
#define                                 OB1E_bit            _BIT_ACCESS(PMSTATL,1)
// PMSTATL<OB2E>
extern volatile __bit                   OB2E                __at(0x7AA2);	// @ (0xF54 * 8 + 2)
#define                                 OB2E_bit            _BIT_ACCESS(PMSTATL,2)
// PMSTATL<OB3E>
extern volatile __bit                   OB3E                __at(0x7AA3);	// @ (0xF54 * 8 + 3)
#define                                 OB3E_bit            _BIT_ACCESS(PMSTATL,3)
// PMSTATL<OBE>
extern volatile __bit                   OBE                 __at(0x7AA7);	// @ (0xF54 * 8 + 7)
#define                                 OBE_bit             _BIT_ACCESS(PMSTATL,7)
// PMSTATL<OBUF>
extern volatile __bit                   OBUF                __at(0x7AA6);	// @ (0xF54 * 8 + 6)
#define                                 OBUF_bit            _BIT_ACCESS(PMSTATL,6)
// RCSTA1<OERR1>
extern volatile __bit                   OERR1               __at(0x7D61);	// @ (0xFAC * 8 + 1)
#define                                 OERR1_bit           _BIT_ACCESS(RCSTA1,1)
// RCSTA2<OERR2>
extern volatile __bit                   OERR2               __at(0x7CE1);	// @ (0xF9C * 8 + 1)
#define                                 OERR2_bit           _BIT_ACCESS(RCSTA2,1)
// PORTA<OSC1>
extern volatile __bit                   OSC1                __at(0x7C07);	// @ (0xF80 * 8 + 7)
#define                                 OSC1_bit            _BIT_ACCESS(PORTA,7)
// PORTA<OSC2>
extern volatile __bit                   OSC2                __at(0x7C06);	// @ (0xF80 * 8 + 6)
#define                                 OSC2_bit            _BIT_ACCESS(PORTA,6)
// PIE2<OSCFIE>
extern volatile __bit                   OSCFIE              __at(0x7D07);	// @ (0xFA0 * 8 + 7)
#define                                 OSCFIE_bit          _BIT_ACCESS(PIE2,7)
// PIR2<OSCFIF>
extern volatile __bit                   OSCFIF              __at(0x7D0F);	// @ (0xFA1 * 8 + 7)
#define                                 OSCFIF_bit          _BIT_ACCESS(PIR2,7)
// IPR2<OSCFIP>
extern volatile __bit                   OSCFIP              __at(0x7D17);	// @ (0xFA2 * 8 + 7)
#define                                 OSCFIP_bit          _BIT_ACCESS(IPR2,7)
// OSCCON<OSTS>
extern volatile __bit                   OSTS                __at(0x7E9B);	// @ (0xFD3 * 8 + 3)
#define                                 OSTS_bit            _BIT_ACCESS(OSCCON,3)
// STATUS<OV>
extern volatile __bit                   OV                  __at(0x7EC3);	// @ (0xFD8 * 8 + 3)
#define                                 OV_bit              _BIT_ACCESS(STATUS,3)
// STATUS<OVERFLOW>
extern volatile __bit                   OVERFLOW            __at(0x7EC3);	// @ (0xFD8 * 8 + 3)
#define                                 OVERFLOW_bit        _BIT_ACCESS(STATUS,3)
// ECCP1DEL<P1DC0>
extern volatile __bit                   P1DC0               __at(0x7DE8);	// @ (0xFBD * 8 + 0)
#define                                 P1DC0_bit           _BIT_ACCESS(ECCP1DEL,0)
// ECCP1DEL<P1DC1>
extern volatile __bit                   P1DC1               __at(0x7DE9);	// @ (0xFBD * 8 + 1)
#define                                 P1DC1_bit           _BIT_ACCESS(ECCP1DEL,1)
// ECCP1DEL<P1DC2>
extern volatile __bit                   P1DC2               __at(0x7DEA);	// @ (0xFBD * 8 + 2)
#define                                 P1DC2_bit           _BIT_ACCESS(ECCP1DEL,2)
// ECCP1DEL<P1DC3>
extern volatile __bit                   P1DC3               __at(0x7DEB);	// @ (0xFBD * 8 + 3)
#define                                 P1DC3_bit           _BIT_ACCESS(ECCP1DEL,3)
// ECCP1DEL<P1DC4>
extern volatile __bit                   P1DC4               __at(0x7DEC);	// @ (0xFBD * 8 + 4)
#define                                 P1DC4_bit           _BIT_ACCESS(ECCP1DEL,4)
// ECCP1DEL<P1DC5>
extern volatile __bit                   P1DC5               __at(0x7DED);	// @ (0xFBD * 8 + 5)
#define                                 P1DC5_bit           _BIT_ACCESS(ECCP1DEL,5)
// ECCP1DEL<P1DC6>
extern volatile __bit                   P1DC6               __at(0x7DEE);	// @ (0xFBD * 8 + 6)
#define                                 P1DC6_bit           _BIT_ACCESS(ECCP1DEL,6)
// CCP1CON<P1M0>
extern volatile __bit                   P1M0                __at(0x7DD6);	// @ (0xFBA * 8 + 6)
#define                                 P1M0_bit            _BIT_ACCESS(CCP1CON,6)
// CCP1CON<P1M1>
extern volatile __bit                   P1M1                __at(0x7DD7);	// @ (0xFBA * 8 + 7)
#define                                 P1M1_bit            _BIT_ACCESS(CCP1CON,7)
// ECCP1DEL<P1RSEN>
extern volatile __bit                   P1RSEN              __at(0x7DEF);	// @ (0xFBD * 8 + 7)
#define                                 P1RSEN_bit          _BIT_ACCESS(ECCP1DEL,7)
// SSP2STAT<P2>
extern volatile __bit                   P2                  __at(0x7B9C);	// @ (0xF73 * 8 + 4)
#define                                 P2_bit              _BIT_ACCESS(SSP2STAT,4)
// PSTR2CON<P2DC02>
extern volatile __bit                   P2DC02              __at(0x7DC8);	// @ (0xFB9 * 8 + 0)
#define                                 P2DC02_bit          _BIT_ACCESS(PSTR2CON,0)
// PSTR2CON<P2DC0CON>
extern volatile __bit                   P2DC0CON            __at(0x7DC8);	// @ (0xFB9 * 8 + 0)
#define                                 P2DC0CON_bit        _BIT_ACCESS(PSTR2CON,0)
// PSTR2CON<P2DC12>
extern volatile __bit                   P2DC12              __at(0x7DC9);	// @ (0xFB9 * 8 + 1)
#define                                 P2DC12_bit          _BIT_ACCESS(PSTR2CON,1)
// PSTR2CON<P2DC1CON>
extern volatile __bit                   P2DC1CON            __at(0x7DC9);	// @ (0xFB9 * 8 + 1)
#define                                 P2DC1CON_bit        _BIT_ACCESS(PSTR2CON,1)
// PSTR2CON<P2DC22>
extern volatile __bit                   P2DC22              __at(0x7DCA);	// @ (0xFB9 * 8 + 2)
#define                                 P2DC22_bit          _BIT_ACCESS(PSTR2CON,2)
// PSTR2CON<P2DC2CON>
extern volatile __bit                   P2DC2CON            __at(0x7DCA);	// @ (0xFB9 * 8 + 2)
#define                                 P2DC2CON_bit        _BIT_ACCESS(PSTR2CON,2)
// PSTR2CON<P2DC32>
extern volatile __bit                   P2DC32              __at(0x7DCB);	// @ (0xFB9 * 8 + 3)
#define                                 P2DC32_bit          _BIT_ACCESS(PSTR2CON,3)
// PSTR2CON<P2DC3CON>
extern volatile __bit                   P2DC3CON            __at(0x7DCB);	// @ (0xFB9 * 8 + 3)
#define                                 P2DC3CON_bit        _BIT_ACCESS(PSTR2CON,3)
// PSTR2CON<P2DC42>
extern volatile __bit                   P2DC42              __at(0x7DCC);	// @ (0xFB9 * 8 + 4)
#define                                 P2DC42_bit          _BIT_ACCESS(PSTR2CON,4)
// PSTR2CON<P2DC4CON>
extern volatile __bit                   P2DC4CON            __at(0x7DCC);	// @ (0xFB9 * 8 + 4)
#define                                 P2DC4CON_bit        _BIT_ACCESS(PSTR2CON,4)
// PSTR2CON<P2DC52>
extern volatile __bit                   P2DC52              __at(0x7DCD);	// @ (0xFB9 * 8 + 5)
#define                                 P2DC52_bit          _BIT_ACCESS(PSTR2CON,5)
// PSTR2CON<P2DC5CON>
extern volatile __bit                   P2DC5CON            __at(0x7DCD);	// @ (0xFB9 * 8 + 5)
#define                                 P2DC5CON_bit        _BIT_ACCESS(PSTR2CON,5)
// PSTR2CON<P2DC62>
extern volatile __bit                   P2DC62              __at(0x7DCE);	// @ (0xFB9 * 8 + 6)
#define                                 P2DC62_bit          _BIT_ACCESS(PSTR2CON,6)
// PSTR2CON<P2DC6CON>
extern volatile __bit                   P2DC6CON            __at(0x7DCE);	// @ (0xFB9 * 8 + 6)
#define                                 P2DC6CON_bit        _BIT_ACCESS(PSTR2CON,6)
// CCP2CON<P2M0>
extern volatile __bit                   P2M0                __at(0x7DA6);	// @ (0xFB4 * 8 + 6)
#define                                 P2M0_bit            _BIT_ACCESS(CCP2CON,6)
// CCP2CON<P2M1>
extern volatile __bit                   P2M1                __at(0x7DA7);	// @ (0xFB4 * 8 + 7)
#define                                 P2M1_bit            _BIT_ACCESS(CCP2CON,7)
// ECCP2DEL<P2RSEN>
extern volatile __bit                   P2RSEN              __at(0x7DBF);	// @ (0xFB7 * 8 + 7)
#define                                 P2RSEN_bit          _BIT_ACCESS(ECCP2DEL,7)
// ECCP3DEL<P3DC0>
extern volatile __bit                   P3DC0               __at(0x78C0);	// @ (0xF18 * 8 + 0)
#define                                 P3DC0_bit           _BIT_ACCESS(ECCP3DEL,0)
// ECCP3DEL<P3DC1>
extern volatile __bit                   P3DC1               __at(0x78C1);	// @ (0xF18 * 8 + 1)
#define                                 P3DC1_bit           _BIT_ACCESS(ECCP3DEL,1)
// ECCP3DEL<P3DC2>
extern volatile __bit                   P3DC2               __at(0x78C2);	// @ (0xF18 * 8 + 2)
#define                                 P3DC2_bit           _BIT_ACCESS(ECCP3DEL,2)
// ECCP3DEL<P3DC3>
extern volatile __bit                   P3DC3               __at(0x78C3);	// @ (0xF18 * 8 + 3)
#define                                 P3DC3_bit           _BIT_ACCESS(ECCP3DEL,3)
// ECCP3DEL<P3DC4>
extern volatile __bit                   P3DC4               __at(0x78C4);	// @ (0xF18 * 8 + 4)
#define                                 P3DC4_bit           _BIT_ACCESS(ECCP3DEL,4)
// ECCP3DEL<P3DC5>
extern volatile __bit                   P3DC5               __at(0x78C5);	// @ (0xF18 * 8 + 5)
#define                                 P3DC5_bit           _BIT_ACCESS(ECCP3DEL,5)
// ECCP3DEL<P3DC6>
extern volatile __bit                   P3DC6               __at(0x78C6);	// @ (0xF18 * 8 + 6)
#define                                 P3DC6_bit           _BIT_ACCESS(ECCP3DEL,6)
// CCP3CON<P3M0>
extern volatile __bit                   P3M0                __at(0x78AE);	// @ (0xF15 * 8 + 6)
#define                                 P3M0_bit            _BIT_ACCESS(CCP3CON,6)
// CCP3CON<P3M1>
extern volatile __bit                   P3M1                __at(0x78AF);	// @ (0xF15 * 8 + 7)
#define                                 P3M1_bit            _BIT_ACCESS(CCP3CON,7)
// ECCP3DEL<P3RSEN>
extern volatile __bit                   P3RSEN              __at(0x78C7);	// @ (0xF18 * 8 + 7)
#define                                 P3RSEN_bit          _BIT_ACCESS(ECCP3DEL,7)
// PORTC<PA1>
extern volatile __bit                   PA1                 __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 PA1_bit             _BIT_ACCESS(PORTC,2)
// PORTC<PA2>
extern volatile __bit                   PA2                 __at(0x7C11);	// @ (0xF82 * 8 + 1)
#define                                 PA2_bit             _BIT_ACCESS(PORTC,1)
// PORTE<PB2>
extern volatile __bit                   PB2                 __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 PB2_bit             _BIT_ACCESS(PORTE,2)
// PORTE<PC2>
extern volatile __bit                   PC2                 __at(0x7C21);	// @ (0xF84 * 8 + 1)
#define                                 PC2_bit             _BIT_ACCESS(PORTE,1)
// ANCON0<PCFG0>
extern volatile __bit                   PCFG0               __at(0x7A40);	// @ (0xF48 * 8 + 0)
#define                                 PCFG0_bit           _BIT_ACCESS(ANCON0,0)
// ANCON0<PCFG1>
extern volatile __bit                   PCFG1               __at(0x7A41);	// @ (0xF48 * 8 + 1)
#define                                 PCFG1_bit           _BIT_ACCESS(ANCON0,1)
// ANCON1<PCFG10>
extern volatile __bit                   PCFG10              __at(0x7A4A);	// @ (0xF49 * 8 + 2)
#define                                 PCFG10_bit          _BIT_ACCESS(ANCON1,2)
// ANCON1<PCFG11>
extern volatile __bit                   PCFG11              __at(0x7A4B);	// @ (0xF49 * 8 + 3)
#define                                 PCFG11_bit          _BIT_ACCESS(ANCON1,3)
// ANCON1<PCFG12>
extern volatile __bit                   PCFG12              __at(0x7A4C);	// @ (0xF49 * 8 + 4)
#define                                 PCFG12_bit          _BIT_ACCESS(ANCON1,4)
// ANCON1<PCFG15>
extern volatile __bit                   PCFG15              __at(0x7A4F);	// @ (0xF49 * 8 + 7)
#define                                 PCFG15_bit          _BIT_ACCESS(ANCON1,7)
// ANCON0<PCFG2>
extern volatile __bit                   PCFG2               __at(0x7A42);	// @ (0xF48 * 8 + 2)
#define                                 PCFG2_bit           _BIT_ACCESS(ANCON0,2)
// ANCON0<PCFG3>
extern volatile __bit                   PCFG3               __at(0x7A43);	// @ (0xF48 * 8 + 3)
#define                                 PCFG3_bit           _BIT_ACCESS(ANCON0,3)
// ANCON0<PCFG4>
extern volatile __bit                   PCFG4               __at(0x7A44);	// @ (0xF48 * 8 + 4)
#define                                 PCFG4_bit           _BIT_ACCESS(ANCON0,4)
// ANCON0<PCFG5>
extern volatile __bit                   PCFG5               __at(0x7A45);	// @ (0xF48 * 8 + 5)
#define                                 PCFG5_bit           _BIT_ACCESS(ANCON0,5)
// ANCON0<PCFG6>
extern volatile __bit                   PCFG6               __at(0x7A46);	// @ (0xF48 * 8 + 6)
#define                                 PCFG6_bit           _BIT_ACCESS(ANCON0,6)
// ANCON0<PCFG7>
extern volatile __bit                   PCFG7               __at(0x7A47);	// @ (0xF48 * 8 + 7)
#define                                 PCFG7_bit           _BIT_ACCESS(ANCON0,7)
// ANCON1<PCFG8>
extern volatile __bit                   PCFG8               __at(0x7A48);	// @ (0xF49 * 8 + 0)
#define                                 PCFG8_bit           _BIT_ACCESS(ANCON1,0)
// ANCON1<PCFG9>
extern volatile __bit                   PCFG9               __at(0x7A49);	// @ (0xF49 * 8 + 1)
#define                                 PCFG9_bit           _BIT_ACCESS(ANCON1,1)
// RCON<PD>
extern volatile __bit                   PD                  __at(0x7E82);	// @ (0xFD0 * 8 + 2)
#define                                 PD_bit              _BIT_ACCESS(RCON,2)
// INTCON<PEIE>
extern volatile __bit                   PEIE                __at(0x7F96);	// @ (0xFF2 * 8 + 6)
#define                                 PEIE_bit            _BIT_ACCESS(INTCON,6)
// INTCON<PEIE_GIEL>
extern volatile __bit                   PEIE_GIEL           __at(0x7F96);	// @ (0xFF2 * 8 + 6)
#define                                 PEIE_GIEL_bit       _BIT_ACCESS(INTCON,6)
// SSP1CON2<PEN1>
extern volatile __bit                   PEN1                __at(0x7E2A);	// @ (0xFC5 * 8 + 2)
#define                                 PEN1_bit            _BIT_ACCESS(SSP1CON2,2)
// SSP2CON2<PEN2>
extern volatile __bit                   PEN2                __at(0x7B8A);	// @ (0xF71 * 8 + 2)
#define                                 PEN2_bit            _BIT_ACCESS(SSP2CON2,2)
// PORTB<PGC>
extern volatile __bit                   PGC                 __at(0x7C0E);	// @ (0xF81 * 8 + 6)
#define                                 PGC_bit             _BIT_ACCESS(PORTB,6)
// PORTB<PGD>
extern volatile __bit                   PGD                 __at(0x7C0F);	// @ (0xF81 * 8 + 7)
#define                                 PGD_bit             _BIT_ACCESS(PORTB,7)
// OSCTUNE<PLLEN>
extern volatile __bit                   PLLEN               __at(0x7CDE);	// @ (0xF9B * 8 + 6)
#define                                 PLLEN_bit           _BIT_ACCESS(OSCTUNE,6)
// PORTB<PMA0>
extern volatile __bit                   PMA0                __at(0x7C0D);	// @ (0xF81 * 8 + 5)
#define                                 PMA0_bit            _BIT_ACCESS(PORTB,5)
// PORTB<PMA1>
extern volatile __bit                   PMA1                __at(0x7C0C);	// @ (0xF81 * 8 + 4)
#define                                 PMA1_bit            _BIT_ACCESS(PORTB,4)
// PORTB<PMA2>
extern volatile __bit                   PMA2                __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 PMA2_bit            _BIT_ACCESS(PORTB,3)
// PORTB<PMA3>
extern volatile __bit                   PMA3                __at(0x7C0A);	// @ (0xF81 * 8 + 2)
#define                                 PMA3_bit            _BIT_ACCESS(PORTB,2)
// PORTC<PMA4>
extern volatile __bit                   PMA4                __at(0x7C17);	// @ (0xF82 * 8 + 7)
#define                                 PMA4_bit            _BIT_ACCESS(PORTC,7)
// PORTC<PMA5>
extern volatile __bit                   PMA5                __at(0x7C16);	// @ (0xF82 * 8 + 6)
#define                                 PMA5_bit            _BIT_ACCESS(PORTC,6)
// PORTA<PMA6>
extern volatile __bit                   PMA6                __at(0x7C00);	// @ (0xF80 * 8 + 0)
#define                                 PMA6_bit            _BIT_ACCESS(PORTA,0)
// PORTA<PMA7>
extern volatile __bit                   PMA7                __at(0x7C01);	// @ (0xF80 * 8 + 1)
#define                                 PMA7_bit            _BIT_ACCESS(PORTA,1)
// PORTB<PMBE>
extern volatile __bit                   PMBE                __at(0x7C09);	// @ (0xF81 * 8 + 1)
#define                                 PMBE_bit            _BIT_ACCESS(PORTB,1)
// PORTE<PMCS>
extern volatile __bit                   PMCS                __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 PMCS_bit            _BIT_ACCESS(PORTE,2)
// PORTD<PMD0>
extern volatile __bit                   PMD0                __at(0x7C18);	// @ (0xF83 * 8 + 0)
#define                                 PMD0_bit            _BIT_ACCESS(PORTD,0)
// PORTD<PMD1>
extern volatile __bit                   PMD1                __at(0x7C19);	// @ (0xF83 * 8 + 1)
#define                                 PMD1_bit            _BIT_ACCESS(PORTD,1)
// PORTD<PMD2>
extern volatile __bit                   PMD2                __at(0x7C1A);	// @ (0xF83 * 8 + 2)
#define                                 PMD2_bit            _BIT_ACCESS(PORTD,2)
// PORTD<PMD3>
extern volatile __bit                   PMD3                __at(0x7C1B);	// @ (0xF83 * 8 + 3)
#define                                 PMD3_bit            _BIT_ACCESS(PORTD,3)
// PORTD<PMD4>
extern volatile __bit                   PMD4                __at(0x7C1C);	// @ (0xF83 * 8 + 4)
#define                                 PMD4_bit            _BIT_ACCESS(PORTD,4)
// PORTD<PMD5>
extern volatile __bit                   PMD5                __at(0x7C1D);	// @ (0xF83 * 8 + 5)
#define                                 PMD5_bit            _BIT_ACCESS(PORTD,5)
// PORTD<PMD6>
extern volatile __bit                   PMD6                __at(0x7C1E);	// @ (0xF83 * 8 + 6)
#define                                 PMD6_bit            _BIT_ACCESS(PORTD,6)
// PORTD<PMD7>
extern volatile __bit                   PMD7                __at(0x7C1F);	// @ (0xF83 * 8 + 7)
#define                                 PMD7_bit            _BIT_ACCESS(PORTD,7)
// PMDIS0<PMDADC>
extern volatile __bit                   PMDADC              __at(0x75C8);	// @ (0xEB9 * 8 + 0)
#define                                 PMDADC_bit          _BIT_ACCESS(PMDIS0,0)
// PMDIS3<PMDCCP10>
extern volatile __bit                   PMDCCP10            __at(0x75E7);	// @ (0xEBC * 8 + 7)
#define                                 PMDCCP10_bit        _BIT_ACCESS(PMDIS3,7)
// PMDIS3<PMDCCP4>
extern volatile __bit                   PMDCCP4             __at(0x75E1);	// @ (0xEBC * 8 + 1)
#define                                 PMDCCP4_bit         _BIT_ACCESS(PMDIS3,1)
// PMDIS3<PMDCCP5>
extern volatile __bit                   PMDCCP5             __at(0x75E2);	// @ (0xEBC * 8 + 2)
#define                                 PMDCCP5_bit         _BIT_ACCESS(PMDIS3,2)
// PMDIS3<PMDCCP6>
extern volatile __bit                   PMDCCP6             __at(0x75E3);	// @ (0xEBC * 8 + 3)
#define                                 PMDCCP6_bit         _BIT_ACCESS(PMDIS3,3)
// PMDIS3<PMDCCP7>
extern volatile __bit                   PMDCCP7             __at(0x75E4);	// @ (0xEBC * 8 + 4)
#define                                 PMDCCP7_bit         _BIT_ACCESS(PMDIS3,4)
// PMDIS3<PMDCCP8>
extern volatile __bit                   PMDCCP8             __at(0x75E5);	// @ (0xEBC * 8 + 5)
#define                                 PMDCCP8_bit         _BIT_ACCESS(PMDIS3,5)
// PMDIS3<PMDCCP9>
extern volatile __bit                   PMDCCP9             __at(0x75E6);	// @ (0xEBC * 8 + 6)
#define                                 PMDCCP9_bit         _BIT_ACCESS(PMDIS3,6)
// PMDIS2<PMDCMP1>
extern volatile __bit                   PMDCMP1             __at(0x75D8);	// @ (0xEBB * 8 + 0)
#define                                 PMDCMP1_bit         _BIT_ACCESS(PMDIS2,0)
// PMDIS2<PMDCMP2>
extern volatile __bit                   PMDCMP2             __at(0x75D9);	// @ (0xEBB * 8 + 1)
#define                                 PMDCMP2_bit         _BIT_ACCESS(PMDIS2,1)
// PMDIS2<PMDCMP3>
extern volatile __bit                   PMDCMP3             __at(0x75DA);	// @ (0xEBB * 8 + 2)
#define                                 PMDCMP3_bit         _BIT_ACCESS(PMDIS2,2)
// PMDIS1<PMDCTMU>
extern volatile __bit                   PMDCTMU             __at(0x75D6);	// @ (0xEBA * 8 + 6)
#define                                 PMDCTMU_bit         _BIT_ACCESS(PMDIS1,6)
// PMDIS0<PMDECCP1>
extern volatile __bit                   PMDECCP1            __at(0x75CD);	// @ (0xEB9 * 8 + 5)
#define                                 PMDECCP1_bit        _BIT_ACCESS(PMDIS0,5)
// PMDIS0<PMDECCP2>
extern volatile __bit                   PMDECCP2            __at(0x75CE);	// @ (0xEB9 * 8 + 6)
#define                                 PMDECCP2_bit        _BIT_ACCESS(PMDIS0,6)
// PMDIS0<PMDECCP3>
extern volatile __bit                   PMDECCP3            __at(0x75CF);	// @ (0xEB9 * 8 + 7)
#define                                 PMDECCP3_bit        _BIT_ACCESS(PMDIS0,7)
// PMDIS0<PMDMSSP1>
extern volatile __bit                   PMDMSSP1            __at(0x75C9);	// @ (0xEB9 * 8 + 1)
#define                                 PMDMSSP1_bit        _BIT_ACCESS(PMDIS0,1)
// PMDIS0<PMDMSSP2>
extern volatile __bit                   PMDMSSP2            __at(0x75CA);	// @ (0xEB9 * 8 + 2)
#define                                 PMDMSSP2_bit        _BIT_ACCESS(PMDIS0,2)
// PMDIS1<PMDPSP>
